TP3/cluster_benchmark.txt
No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 6

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 5 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            146342
        write:                           52218
        other:                           20886
        total:                           219446
    transactions:                        10433  (173.81 per sec.)
    deadlocks:                           20     (0.33 per sec.)
    read/write requests:                 198560 (3308.01 per sec.)
    other operations:                    20886  (347.96 per sec.)

Test execution summary:
    total time:                          60.0240s
    total number of events:              10433
    total time taken by event execution: 360.0303
    per-request statistics:
         min:                                 15.15ms
         avg:                                 34.51ms
         max:                               4853.05ms
         approx.  95 percentile:              34.71ms

Threads fairness:
    events (avg/stddev):           1738.8333/30.26
    execution time (avg/stddev):   60.0051/0.01