TP3/standalone_benchmark.txt
No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 6

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 5 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            375592
        write:                           133264
        other:                           53290
        total:                           562146
    transactions:                        26462  (440.98 per sec.)
    deadlocks:                           366    (6.10 per sec.)
    read/write requests:                 508856 (8479.88 per sec.)
    other operations:                    53290  (888.06 per sec.)

Test execution summary:
    total time:                          60.0074s
    total number of events:              26462
    total time taken by event execution: 359.9257
    per-request statistics:
         min:                                  4.03ms
         avg:                                 13.60ms
         max:                                 51.62ms
         approx.  95 percentile:              23.47ms

Threads fairness:
    events (avg/stddev):           4410.3333/13.97
    execution time (avg/stddev):   59.9876/0.00